# EDA : Exploratory Data Analysis and preprocessing

In [1]:
'''
1. First collect the data
2. Understand the data
    1. Exploring Data
    2. Preprocessing and cleaning
        A. Handle missing value
        B. Handling Outlier
        C. Handle skewness
        D. Handling categorical Data
        E. Scaling
        F. Feature Engineering
'''

'\n1. First collect the data\n2. Understand the data\n    1. Exploring Data\n    2. Preprocessing and cleaning\n        A. Handle missing value\n        B. Handling Outlier\n        C. Handle skewness\n        D. Handling categorical Data\n        E. Scaling\n        F. Feature Engineering\n'

In [2]:
#Prerequisite
'''
1. Numpy
2. Pandas
3. Matplotlib.pyplot
4. Seaborn
5. Statistics
'''

'\n1. Numpy\n2. Pandas\n3. Matplotlib.pyplot\n4. Seaborn\n5. Statistics\n'

In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [5]:
#handling the null values means missing value
#To create a null value : use nan inbuilt method of numpy
np.nan

nan

In [6]:
#I have some List
name=["Reeta","Anu","Tina","Pankaj","Kamal"]
math=[89,78,67,np.nan,85]
science=[78,75,np.nan,np.nan,76]

In [7]:
#we create dictionary with the help of list
d={"name":name,"math":math,"science":science}

In [8]:
#create DataFrame
df=pd.DataFrame(d)

In [9]:
print(df)

     name  math  science
0   Reeta  89.0     78.0
1     Anu  78.0     75.0
2    Tina  67.0      NaN
3  Pankaj   NaN      NaN
4   Kamal  85.0     76.0

In [10]:
#First talk about drop null value or reslove from any technique

In [11]:
#How to detect the null value in dataset, use isnull() inbuilt function
df.isnull()

    name   math  science
0  False  False    False
1  False  False    False
2  False  False     True
3  False   True     True
4  False  False    False

In [12]:
#how many null values in each columns
df.isnull().sum()

name       0
math       1
science    2
dtype: int64

In [13]:
#drop null values
#to drop the rows consists the null values
df.dropna()  #by default drop row(only temporary delete)

    name  math  science
0  Reeta  89.0     78.0
1    Anu  78.0     75.0
4  Kamal  85.0     76.0

In [14]:
df

     name  math  science
0   Reeta  89.0     78.0
1     Anu  78.0     75.0
2    Tina  67.0      NaN
3  Pankaj   NaN      NaN
4   Kamal  85.0     76.0

In [15]:
#To drop columns which have null values temporary
df.dropna(axis=1)   #axis=1 means columns

     name
0   Reeta
1     Anu
2    Tina
3  Pankaj
4   Kamal

In [17]:
#to delete 2nd row
df.drop(2)  #2 row index

     name  math  science
0   Reeta  89.0     78.0
1     Anu  78.0     75.0
3  Pankaj   NaN      NaN
4   Kamal  85.0     76.0

In [18]:
df

     name  math  science
0   Reeta  89.0     78.0
1     Anu  78.0     75.0
2    Tina  67.0      NaN
3  Pankaj   NaN      NaN
4   Kamal  85.0     76.0

In [19]:
#we can be drop multiple rows together
df.drop([2,3])  #2nd and 3rd record means row index

    name  math  science
0  Reeta  89.0     78.0
1    Anu  78.0     75.0
4  Kamal  85.0     76.0

In [23]:
#I want to drop column
df.drop("math",axis=1)   #to drop math column axis=1

     name  science
0   Reeta     78.0
1     Anu     75.0
2    Tina      NaN
3  Pankaj      NaN
4   Kamal     76.0

In [24]:
#drop multiple drop
df.drop(["math","science"],axis=1)

     name
0   Reeta
1     Anu
2    Tina
3  Pankaj
4   Kamal

In [ ]:
#Best solution is fill null values

In [25]:
#use central tendency : mean/median/mode
#fill Null values with mean
m=df["math"].mean() #find average or mean of math column
s=df["science"].mean()  #find average or mean of science column

In [26]:
m

79.75

In [27]:
s

76.33333333333333

In [28]:
#fill Null values in math with m
df["math"].fillna(m,inplace=True)  #inplace=True means permant change in df

In [29]:
df

     name   math  science
0   Reeta  89.00     78.0
1     Anu  78.00     75.0
2    Tina  67.00      NaN
3  Pankaj  79.75      NaN
4   Kamal  85.00     76.0

In [32]:
#fill Null values in math with s
df["science"].fillna(s,inplace=True)  #inplace=True means permant change in df

In [33]:
df

     name   math    science
0   Reeta  89.00  78.000000
1     Anu  78.00  75.000000
2    Tina  67.00  76.333333
3  Pankaj  79.75  76.333333
4   Kamal  85.00  76.000000